{
  "plugins": {
    "comment-box": {
      "src": "https://github.com/LudoPinelli/comment-box.nvim"
    },
    "fff": {
      "src": "https://github.com/dmtrKovalenko/fff.nvim"
    },
    "import": {
      "src": "https://github.com/piersolenski/import.nvim"
    },
    "markdown-preview": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "mkdnflow": {
      "src": "https://github.com/jakewvincent/mkdnflow.nvim"
    },
    "neo-tree": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim"
    },
    "neocodeium": {
      "src": "https://github.com/monkoose/neocodeium"
    },
    "noice": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "nui": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-python": {
      "src": "https://github.com/mfussenegger/nvim-dap-python"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround"
    },
    "nvimesweeper": {
      "src": "https://github.com/seandewar/nvimesweeper"
    },
    "persistent-breakpoints": {
      "src": "https://github.com/Weissle/persistent-breakpoints.nvim"
    },
    "plenary": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "sidekick": {
      "src": "https://github.com/folke/sidekick.nvim"
    },
    "statuscol": {
      "src": "https://github.com/luukvbaal/statuscol.nvim"
    },
    "text-case": {
      "src": "https://github.com/johmsalas/text-case.nvim"
    },
    "treesj": {
      "src": "https://github.com/Wansmer/treesj"
    },
    "vim-moonfly-colors": {
      "src": "https://github.com/bluz71/vim-moonfly-colors"
    },
    "zen-mode": {
      "src": "https://github.com/folke/zen-mode.nvim"
    }
  }
}
