{
  "plugins": {
    "Comment": {
      "src": "https://github.com/numToStr/Comment.nvim"
    },
    "FixCursorHold": {
      "src": "https://github.com/antoinemadec/FixCursorHold.nvim"
    },
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "Navigator": {
      "src": "https://github.com/numToStr/Navigator.nvim"
    },
    "alpha-nvim": {
      "src": "https://github.com/goolord/alpha-nvim"
    },
    "bufferline": {
      "src": "https://github.com/akinsho/bufferline.nvim"
    },
    "bufstack": {
      "src": "https://github.com/BibekBhusal0/bufstack.nvim"
    },
    "cellular-automaton": {
      "src": "https://github.com/eandrju/cellular-automaton.nvim"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip"
    },
    "codedocs": {
      "src": "https://github.com/jeangiraldoo/codedocs.nvim"
    },
    "comment-box": {
      "src": "https://github.com/LudoPinelli/comment-box.nvim"
    },
    "diffview": {
      "src": "https://github.com/sindrets/diffview.nvim"
    },
    "fff": {
      "src": "https://github.com/dmtrKovalenko/fff.nvim"
    },
    "fortune": {
      "src": "https://github.com/rubiin/fortune.nvim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "garbage-day": {
      "src": "https://github.com/Zeioth/garbage-day.nvim"
    },
    "git-statusline": {
      "src": "https://github.com/mattmorgis/git-statusline.nvim"
    },
    "git-worktree": {
      "src": "https://github.com/polarmutex/git-worktree.nvim"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "hacker": {
      "src": "https://github.com/letieu/hacker.nvim"
    },
    "hardtime": {
      "src": "https://github.com/m4xshen/hardtime.nvim"
    },
    "icon-picker": {
      "src": "https://github.com/ziontee113/icon-picker.nvim"
    },
    "import": {
      "src": "https://github.com/piersolenski/import.nvim"
    },
    "indent-blankline": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "jsx-element": {
      "src": "https://github.com/mawkler/jsx-element.nvim"
    },
    "key-analyzer": {
      "src": "https://github.com/meznaric/key-analyzer.nvim"
    },
    "killersheep": {
      "src": "https://github.com/seandewar/killersheep.nvim"
    },
    "lazydev": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "leetcode": {
      "src": "https://github.com/kawre/leetcode.nvim"
    },
    "live-server": {
      "src": "https://github.com/barrett-ruth/live-server.nvim"
    },
    "lualine": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "markdown-preview": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "mason": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "mason-lspconfig": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim"
    },
    "mason-null-ls": {
      "src": "https://github.com/jayp0521/mason-null-ls.nvim"
    },
    "mason-tool-installer": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim"
    },
    "mini.files": {
      "src": "https://github.com/nvim-mini/mini.files"
    },
    "mini.notify": {
      "src": "https://github.com/nvim-mini/mini.notify"
    },
    "mini.operators": {
      "src": "https://github.com/nvim-mini/mini.operators"
    },
    "mini.trailspace": {
      "src": "https://github.com/nvim-mini/mini.trailspace"
    },
    "mkdnflow": {
      "src": "https://github.com/jakewvincent/mkdnflow.nvim"
    },
    "neo-tree": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim"
    },
    "neocodeium": {
      "src": "https://github.com/monkoose/neocodeium"
    },
    "neoscroll": {
      "src": "https://github.com/karb94/neoscroll.nvim"
    },
    "neotest": {
      "src": "https://github.com/nvim-neotest/neotest"
    },
    "neotest-bun": {
      "src": "https://github.com/arthur944/neotest-bun"
    },
    "noice": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "none-ls": {
      "src": "https://github.com/nvimtools/none-ls.nvim"
    },
    "none-ls-extras": {
      "src": "https://github.com/nvimtools/none-ls-extras.nvim"
    },
    "nui": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-python": {
      "src": "https://github.com/mfussenegger/nvim-dap-python"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-git-utils": {
      "src": "https://github.com/BibekBhusal0/nvim-git-utils"
    },
    "nvim-hlslens": {
      "src": "https://github.com/kevinhwang91/nvim-hlslens"
    },
    "nvim-lsp-file-operations": {
      "src": "https://github.com/antosha417/nvim-lsp-file-operations"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-navbuddy": {
      "src": "https://github.com/SmiteshP/nvim-navbuddy"
    },
    "nvim-navic": {
      "src": "https://github.com/SmiteshP/nvim-navic"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nvim-scrollbar": {
      "src": "https://github.com/petertriho/nvim-scrollbar"
    },
    "nvim-shadcn": {
      "src": "https://github.com/BibekBhusal0/nvim-shadcn"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround"
    },
    "nvim-tetris": {
      "src": "https://github.com/alec-gibson/nvim-tetris"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag"
    },
    "nvim-ts-context-commentstring": {
      "src": "https://github.com/JoosepAlviste/nvim-ts-context-commentstring"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "nvimesweeper": {
      "src": "https://github.com/seandewar/nvimesweeper"
    },
    "octo": {
      "src": "https://github.com/pwntester/octo.nvim"
    },
    "persistent-breakpoints": {
      "src": "https://github.com/Weissle/persistent-breakpoints.nvim"
    },
    "pipeline": {
      "src": "https://github.com/topaxi/pipeline.nvim"
    },
    "plenary": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "resession": {
      "src": "https://github.com/stevearc/resession.nvim"
    },
    "scope": {
      "src": "https://github.com/tiagovla/scope.nvim"
    },
    "showkeys": {
      "src": "https://github.com/nvzone/showkeys"
    },
    "sidekick": {
      "src": "https://github.com/folke/sidekick.nvim"
    },
    "smear-cursor": {
      "src": "https://github.com/sphamba/smear-cursor.nvim"
    },
    "snap": {
      "src": "https://github.com/mistweaverco/snap.nvim"
    },
    "statuscol": {
      "src": "https://github.com/luukvbaal/statuscol.nvim"
    },
    "tailwind-fold": {
      "src": "https://github.com/razak17/tailwind-fold.nvim"
    },
    "telescope": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "telescope-git-diffs": {
      "src": "https://github.com/paopaol/telescope-git-diffs.nvim"
    },
    "telescope-lazy": {
      "src": "https://github.com/tsakirist/telescope-lazy.nvim"
    },
    "telescope-ui-select": {
      "src": "https://github.com/nvim-telescope/telescope-ui-select.nvim"
    },
    "telescope-zoxide": {
      "src": "https://github.com/jvgrootveld/telescope-zoxide"
    },
    "text-case": {
      "src": "https://github.com/johmsalas/text-case.nvim"
    },
    "tiny-inline-diagnostic": {
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim"
    },
    "todo-comments": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "treesj": {
      "src": "https://github.com/Wansmer/treesj"
    },
    "trouble": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "ts-error-translator": {
      "src": "https://github.com/dmmulroy/ts-error-translator.nvim"
    },
    "twilight": {
      "src": "https://github.com/folke/twilight.nvim"
    },
    "vim-bbye": {
      "src": "https://github.com/moll/vim-bbye"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-moonfly-colors": {
      "src": "https://github.com/bluz71/vim-moonfly-colors"
    },
    "vim-quickrun": {
      "src": "https://github.com/thinca/vim-quickrun"
    },
    "vim-rhubarb": {
      "src": "https://github.com/tpope/vim-rhubarb"
    },
    "vim-visual-multi": {
      "src": "https://github.com/mg979/vim-visual-multi"
    },
    "which-key": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "winmove": {
      "src": "https://github.com/MisanthropicBit/winmove.nvim"
    },
    "zen-mode": {
      "src": "https://github.com/folke/zen-mode.nvim"
    }
  }
}
